Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Mac OS X now installs with Perl version number embedded in installation directory names for easier upgrading of user-compiled Perl, and the installation directories in general are more standard.
es_es: Mac OS X ahora se instala con el número de versión de Perl incrustado en los nombres de directorio de la instalación para facilitar la actualización por parte del usuario que compiló Perl, y los directorios de instalación, en general, son más estándar.

source: Many minor bugs have been fixed.
es_es: Muchos pequeños errores han sido corregidos.

source: Previously, the C code implementing $^E did not preserve C<errno>, so reading $^E could cause C<errno> and therefore C<$!> to change unexpectedly.
es_es: Anteriormente, el código en C que implementaba $^E no preservaba C<errno>, por lo que la lectura de $^E podría causar que C<errno> y, por lo tanto, C<$!> cambiaran de forma inesperada.

source: Run Configure with -Duseithreads which will configure Perl with the Perl 5.8.0 "interpreter threads", see L<threads>.
es_es: Ejecute Configure con -Duseithreads que configurará Perl con hilos de ejecución Perl 5.8.0 a nivel de intérprete; vea L<threads>.

source: The most likely cause of this was identified and fixed by Nicholas Clark.
es_es: La causa más probable de ello fue identificado y solucionado por Nicholas Clark.

source: When using C<< > >> or C<< < >> on a C<()> group, this affects all types inside the group that accept byte-order modifiers, including all subgroups.
es_es: Cuando se usa C<< > >> o C<< < >> en un grupo C<()>, afecta a todos los tipos dentro del grupo que acepten a los modificadores de ordenación de bytes, incluyendo a todos los subgrupos.

source: Whitespace is irrelevant:
es_es: El espacio en blanco no es significativo:

source: got <d is under the bar in the >
es_es: obtiene <, al mediodía, se come, y en el >

source: and call it with C<perl dangerous.pl 'rm -rfv *|'>, it actually opens a pipe, executes the C<rm> command and reads C<rm>'s output from that pipe.
es_es: y lo llama con C<perl peligroso.pl 'rm -rfv *|'>, realmente abre una tubería, ejecuta el comando C<rm> y lee la salida de C<rm> desde esa tubería.

source: A major release is one in which most of the functionality has changed, or in which major new functionality is added.
es_es: Una versión principal es aquella en la que la mayor parte de la funcionalidad ha cambiado, o en los que se ha añadido una nueva funcionalidad importante.

source: Also note that, for the superuser on the local filesystems, the C<-r>, C<-R>, C<-w>, and C<-W> tests always return 1, and C<-x> and C<-X> return 1 if any execute bit is set in the mode.
es_es: También note que, para el superusuario en el sistema de archivos local, los test C<-r>, C<-R>, C<-w> y C<-W> siempre devuelven 1, y C<-x> y C<-X> devuelven 1 si cualquier bit de ejecución está puesto en el modo del archivo.

source: B<NOTE:> The behaviour of a C<my> statement modified with a statement modifier conditional or loop construct (e.g. C<my $x if ...>) is B<undefined>.
es_es: B<NOTA:> El comportamiento de una instrucción C<my> modificada con una instrucción de modificador condicional o construcción de bucle (p.e. C<my $x if ...>) es B<indefinido>.

source: perlintro Perl introduction for beginners
es_es: perlintro Introducción a Perl para principiantes

source: This document describes differences between the 5.8.5 release and the 5.8.6 release.
es_es: Este documento describe las diferencias entre la versión 5.8.5 y la versión 5.8.6.

source: There may be more by the time you read this.
es_es: Es posible que cuando lea este documento ya existan otros nuevos.

source: Consequently, some Perl programmers prefer to avoid them altogether.
es_es: Como consecuencia, algunos programadores de Perl prefieren evitarlos.

source: $temp = join($", @ARGV);
es_es: $temporal = join($", @ARGV);

source: =for cynics And how many perl 5.8.x versions can I release ahead of Vista?
es_es: =for cínicos ¿Cuántas versiones de perl 5.8.x puedo lanzar antes de Vista?

source: See L<perl581delta/"Future Directions"> for more soothsaying.
es_es: Ver L<perl581delta/"Direcciones futuras"> para tener una mayor perspectiva.

source: printf '<%.*d>', -1, 0; # prints "<0>"
es_es: printf '<%.*d>', -1, 0; # imprime "<0>"

source: If ARRAY is omitted, shifts the C<@_> array within the lexical scope of subroutines and formats, and the C<@ARGV> array outside a subroutine and also within the lexical scopes established by the C<eval STRING>, C<BEGIN {}>, C<INIT {}>, C<CHECK {}>, C<UNITCHECK {}>, and C<END {}> constructs.
es_es: Si se omite ARRAY, se desplaza el array C<@_> dentro del ámbito léxico de subrutinas y formatos, y el array C<@ARGV> si está fuera de una subrutina y también dentro de los ámbitos léxicos establecidos por construcciones como C<eval CADENA>, C<BEGIN {}>, C<INIT {}>, C<CHECK {}>, C<UNITCHECK {}> y C<END {}>.

source: See L<perlmod> for details.
es_es: Vea L<perlmod> para los detalles.

source: If the ARG part of the pattern was omitted, then C<$REGERROR> will be set to the name of the last C<(*MARK:NAME)> pattern executed, or to TRUE if there was none.
es_es: Si la parte ARG del patrón es omitida, entonces C<$REGERROR> se establecerá al nombre del último patrón C<(*MARK:NOMBRE)> ejecutado, o a TRUE si no había ninguno.

source: Similarly 5.8.5's freeze will be at the end of June, with release by mid July.
es_es: Del mismo modo, la congelación de 5.8.5 será a finales de junio, con el lanzamiento a mediados de julio.

source: If you use wait in your handler for $SIG{CHLD} it may accidentally for the child created by qx() or system().
es_es: Si utiliza wait en su controlador de $SIG{CHLD} puede, accidentalmente, hacer esperar por el hijo creado por qx() o system().

source: For example, this automatically filters compressed arguments through B<gzip>:
es_es: Por ejemplo, esto filtrará automáticamente los argumentos comprimidos a través de B<gzip>:

source: For WHENCE you may use the constants C<SEEK_SET>, C<SEEK_CUR>, and C<SEEK_END> (start of the file, current position, end of the file) from the L<Fcntl> module.
es_es: Para DÓNDE puede usar las constantes C<SEEK_SET>, C<SEEK_CUR> y C<SEEK_END> (inicio del archivo, posición actual y fin de archivo) desde el módulo L<Fcntl>.

source: You may prefer to use the C<each> function to iterate over large DBM files.
es_es: Puede preferir usar la función C<each> para iterar sobre archivos DBM grandes.

source: To get at hash elements:
es_es: Para obtener los elementos de un hash:

source: =head2 Is Perl difficult to learn?
es_es: =head2 ¿Es difícil aprender a programar en Perl?

source: (See the precedence table in L<perlop>.) List operators take more than one argument, while unary operators can never take more than one argument.
es_es: (Ver la tabla de precedencia en L<perlop>.) Los operadores de listas toman más de un argumento, mientras que los operadores unarios nunca toman más de un argumento.

source: =head2 Regular Expressions
es_es: =head2 Expresiones Regulares

source: To read both a command's STDOUT and its STDERR separately, it's easiest to redirect them separately to files, and then read from those files when the program is done:
es_es: Leer tanto el STDOUT como el STDERR de un comando, pero separadamente, es más fácil hacerlos redireccionar separadamente a archivos, y luego leer esos archivos cuando el programa termine:

source: C<kill> is now fatal when called on non-numeric process identifiers.
es_es: C<kill> ahora es fatal cuando es llamado en identificadores de proceso que no son numéricos.

source: =head2 Reinventing the wheel
es_es: =head2 Reinventando la rueda

source: This directory is for dual-life modules where the blead source is canonical.
es_es: Este directorio contiene módulos de evolución dual en los que la versión canónica es la del código fuente de la rama B<blead>.

source: Notice that the final match matched C<q> instead of C<p>, which a match without the C<\G> anchor would have done.
es_es: Observe que el último emparejamiento es C<q> en vez de C<p>, que una coincidencia sin el anclaje C<\G> habría hecho.

source: The two additional lines request from perl to catch various common problems in your code.
es_es: Estas dos líneas adicionales ordenan a perl que detecte diversos problemas comunes en el código.

source: Information still relevant has been moved to L<perlrepository>.
es_es: La información que sigue siendo relevante ha sido movida a L<perlrepository>.

# print join(':', split(/ */, 'hi there')), " ";
source: print join(':', split(/ */, 'hi there')), "\n";
es_es: print join(':', split(/ */, 'hola por aqui')), "\n";

source: =item Otherwise, If EXPR has the UTF8 flag set
es_es: =item De lo contrario, si EXPR tiene la bandera UTF8 puesta

source: C<unless> is the opposite, it executes the statement I<unless> the condition is true (i.e., if the condition is false).
es_es: C<unless> es el opuesto, ejecuta la instrucción si la condición I<no es> verdadera (e.d., si la condición es falsa).

source: This aspect of C<splice> is considered highly experimental.
es_es: Este aspecto de C<splice> es considerado altamente experimental.

source: A later C<(*SKIP)> pattern will then skip forward to that point if backtracked into on failure.
es_es: Un patrón C<(*SKIP)> consiguiente saltará entonces a este punto, si hace una vuelta atrás a causa de un fallo.

source: \w [3] Match a "word" character (alphanumeric plus "_", plus other connector punctuation chars plus Unicode marks)
es_es: \w [3] Coincide con un carácter "palabra" (alfanumérico más "_", más otros caract. de puntuación de continuación, más marcas Unicode)

source: =item length EXPR X<length> X<size>
es_es: =item length EXPR X<length> X<size> X<longitud> X<tamaño>

source: Chris Nandor E<lt>pudge@pobox.comE<gt> continued development and maintenance for the duration of the port's life.
es_es: Chris Nandor E<lt>pudge@pobox.comE<gt> continuó el desarrollo y mantenimiento durante la vida útil de esta versión.

source: Be sure to default all these options to the commonest use.
es_es: Asegúrese de que todas estas opciones estén puestas, por defecto, para el uso más común.

source: (Note: If your rand function consistently returns numbers that are too large or too small, then your version of Perl was probably compiled with the wrong number of RANDBITS.)
es_es: (Nota: si su función rand devuelve constantemente números demasiado grandes o demasiado pequeños, entonces su versión de Perl fue, probablemente, compilada con un número incorrecto de RANDBITS).

source: =item "Reasonable copying fee"
es_es: =item "Cuota razonable por las copias"

source: Reading $^E now preserves $!.
es_es: Leyendo $^E ahora preserva $!.

# print("Hello, world ");
source: print("Hello, world\n");
es_es: print("Hola a todos\n");

source: This is just like C's comma operator.
es_es: Es igual que el operador coma del C.

# print "The Third Element is", $myarray[2], " ";
source: print "The Third Element is", $myarray[2], "\n";
es_es: print "El tercer elemento es", $miarray[2], "\n";

source: See L<perl589delta> for details.
es_es: Vea L<perl589delta> para más detalles.

source: =head2 What is a JAPH?
es_es: =head2 ¿Qué es un JAPH?

source: =item do SUBROUTINE(LIST) X<do>
es_es: =item do SUBRUTINA(LISTA) X<do>

source: %s a string
es_es: %s una cadena

source: It is still possible to backtrack past the construct, but not into it.
es_es: Todavía es posible dar marcha atrás más allá de la construcción, pero no dentro de ella.

source: The optimiser on HP-UX 11.23 (Itanium 2) is currently partly disabled (scaled down to +O1) when using HP C-ANSI-C; the cause of problems at higher optimisation levels is still unclear.
es_es: El optimizador en HP-UX 11.23 (Itanium 2) está ahora, en parte, desactivado (reducido a +O1) cuando se usa en HP C-ANSI-C; la causa de los problemas en los niveles más altos de optimización aún no está clara.

source: $u = @h{'first', 'second'}; # $u is now 'B'
es_es: $u = @h{'primero', 'segundo'}; # $u es ahora 'B'

source: For this reason, the C<use warnings> pragma and the B<-w> switch (that is, the C<$^W> variable) produces warnings if the STRING contains the "," or the "#" character.
es_es: Por esta razón, el pragma C<use warnings> y la opción B<-w> (es decir, la variable C<$^W>) produce advertencias de si la cadena contiene la "," o el carácter "#".

source: As of 5.14, none of these raises an exception if they are not supported on your platform.
es_es: A partir de 5.14, ninguno de estos produce una excepción si no están suportados en su plataforma.

source: Binary "/" divides two numbers.
es_es: Binario "/" divide dos números.

source: And, C<\d+>, may match strings of digits that are a mixture from different writing systems, creating a security issue.
es_es: Y, C<\d+>, puede coincidir con cadenas de dígitos que son una mezcla de diferentes sistemas de escritura, creando un problema de seguridad.

source: Treat string as multiple lines.
es_es: Trata a la cadena como un conjunto de varias líneas.

source: Older threaded Perls (5.8.6 or earlier) will run into this problem.
es_es: Anteriores Perls con threads (5.8.6 o anteriores) tendrán este problema.

source: The subroutine should return either nothing or else a list of up to three values in the following order:
es_es: La subrutina debe devolver, o nada, o bien una lista de hasta tres valores en el orden siguiente:

source: You get this from taking the reference of function calls like C<pos()> or C<substr()>.
es_es: Obtiene esto de la referencia a las llamadas a funciones como C<pos()> o C<substr()>.

source: They are not local to a scope, nor readonly, but instead are volatile package variables similar to C<$AUTOLOAD>.
es_es: No son locales en el ámbito en donde se encuentren, ni de solo lectura, sino que son variables de paquete volátiles, similares a C<$AUTOLOAD>.

source: s|^|$front\{|; redo LINE; } }
es_es: s|^|$frente\{|; redo LINEA; } }

source: As of November 2005, only an alpha version has been released.
es_es: En noviembre de 2005, sólo ha sido lanzada una versión alfa.

source: =head2 Extracting matches
es_es: =head2 Extrayendo coincidencias

source: It is not a general way to portably store floating-point values.
es_es: No es una forma general de almacenar de forma portátil los valores de punto flotante.

source: Something modified the values being iterated over.
es_es: Algo modificó los valores que se utilizaron en la iteración.

source: This is particularly useful for dynamic patterns, such as those read in from a configuration file, taken from an argument, or specified in a table somewhere.
es_es: Esto es particularmente útil para los patrones dinámicos, como los que se leen desde un archivo de configuración, tomados desde un argumento, o especificados en alguna otra tabla.

source: %% a percent sign
es_es: %% un signo de por ciento

source: The author of Perl has never felt the need to use this form of C<goto> (in Perl, that is; C is another matter).
es_es: El autor de Perl nunca ha sentido la necesidad de usar esta forma de C<goto> (en Perl, desde luego. C es otra historia).

source: =head2 Reference Manual
es_es: =head2 Manual de referencia

source: =item I<The Perl Cookbook> (the "Ram Book"):
es_es: =item I<The Perl Cookbook> (el "Libro del Carnero"):

source: This pragma has precedence over the other pragmas listed below that change the defaults.
es_es: Este pragma tiene prioridad sobre otros pragmas listados a continuación que cambian los valores predeterminados.

source: Use \p{Prop} for longer names
es_es: Use \p{Prop} para los nombres largos

source: Match 1 or more times, not greedily
es_es: Coincide con 1 o más veces, sin avaricia

source: perlopenbsd Perl notes for OpenBSD
es_es: perlopenbsd Notas para OpenBSD

source: For measuring time in better granularity than one second, use the L<Time::HiRes> module from Perl 5.8 onwards (or from CPAN before then), or, if you have gettimeofday(2), you may be able to use the C<syscall> interface of Perl.
es_es: Para medir el tiempo con una granularidad mayor de un segundo, use el módulo L<Time::HiRes> de Perl 5.8 (o desde CPAN antes de él), o si tiene gettimeofday(2), puede utilizar el interfaz C<syscall> de Perl.

source: (Why do we have separate numeric and string comparisons?
es_es: ¿Por qué se usa un operador de comparación para números y otro para cadenas?

source: The C3 method resolution order added in 5.10.0 has been re-implemented as a plugin, without changing its Perl-space interface.
es_es: El método de resolución de orden C3 añadido en 5.10.0 se ha re-implementado como un complemento, sin cambiar su interfaz del espacio Perl.

source: If you can get gcc for 5.3, you could try that, too, since gcc in IRIX 6 is a known workaround for at least the shuffle.t and sort.t failures.
es_es: Si puede conseguir gcc para 5.3, podría también intentarlo con él, ya que desde el gcc en IRIX 6 es al menos una solución conocida para los errores de shuffle.t y sort.t.

source: B<WARNING:> The previous example has a bug because the automatic close that happens when the refcount on C<handle> does not properly detect and report failures.
es_es: B<AVISO:> El anterior ejemplo tiene un error porque el cierre automático que sucede cuando el recuento de referencias de C<handle> no lo detecta apropiadamente y da mensajes de error.

source: It is a fatal error if there are no octal digits at all.
es_es: Es un error fatal si no hay dígitos octales.

source: C<s///le> is treated as a substitution followed by the C<le> operator, not the C</le> flags.
es_es: C<s///le> es tratada como una sustitución seguida por el operador C<le>, no las opciones C</le>.

source: C<Time::HiRes> upgraded to version 1.86 (was 1.66)
es_es: C<Time::HiRes> actualizado a la versión 1.86 (era 1.66)

source: Also, if the specified Perl version is greater than or equal to 5.9.5, C<use VERSION> will also load the C<feature> pragma and enable all features available in the requested version.
es_es: Además, si la versión especificada de Perl es mayor o igual a 5.9.5, C<use VERSIÓN> cargará el pragma C<feature> y activará todas las características disponibles en la versión solicitada.

source: The copy of the Unicode Character Database included in Perl 5.8 has been updated to 4.0.1 from 4.0.0.
es_es: La copia de la base de datos de caracteres Unicode incluidos en Perl 5.8 ha sido actualizado desde la 4.0.0 a la 4.0.1.

# 'Now is the time for all' . " " .
source: 'Now is the time for all' . "\n" .
es_es: 'Ahora es el momento de todos' . "\n" .

source: The repeat count gobbles that many values from the LIST when used with all format types other than C<a>, C<A>, C<Z>, C<b>, C<B>, C<h>, C<H>, C<@>, C<.>, C<x>, C<X>, and C<P>, where it means something else, dscribed below.
es_es: El número de repeticiones engulle a tantos valores de la LISTA cuando es usada con todos los tipos de formato que no sean C<a>, C<A>, C<Z>, C<b>, C<B>, C<h>, C<H>, C<@>, C<.>, C<x>, C<X> y C<P>, donde significa otra cosa, descrita abajo.

source: once
es_es: 1 vez

source: If VERSION is provided, C<package> sets the C<$VERSION> variable in the given namespace to a L<version> object with the VERSION provided.
es_es: Si se indica VERSIÓN, C<package> inicializa la variable C<$VERSION> en el espacio de nombres indicado a un objeto L<version> con la VERSIÓN indicada.

source: If your Perl success stories and testimonials may be of help to others who wish to advocate the use of Perl in their applications, or if you wish to simply express your gratitude to Larry and the Perl developers, please write to perl-thanks@perl.org .
es_es: Si considera que sus éxitos con Perl y sus testimonios pueden ayudar a otros programadores que desean utilizar Perl en sus proyectos, o si simplemente quiere expresar su gratitud a Larry y a los demás programadores de Perl, escriba un mensaje a la dirección perl-thanks@perl.org .

source: This prints the whole structure, using the shell-style for() construct to loop across the outer set of subscripts.
es_es: Esto muestra toda la estructura, utilizando la construcción de un bucle al estilo del for() de la shell para ciclar por el conjunto externo de subíndices.

source: Even then, it may not be used to go into any construct that requires initialization, such as a subroutine or a C<foreach> loop.
es_es: Incluso entonces, no se puede usar para ir a cualquier construcción que requiere inicialización, como una subrutina o un bucle C<foreach>.

source: A pattern matching the empty string (not to be confused with an empty pattern C<//>, which is just one member of the set of patterns matching the epmty string), splits EXPR into individual characters.
es_es: Un patrón de coincidencia con la cadena vacía (que no debe confundirse con un patrón vacío C<//>, que es sólo un miembro del conjunto de patrones coincidentes con la cadena vacía), divide EXPR en caracteres individuales.

source: (I<Loss of information>)
es_es: (I<Pérdida de información>)

source: utime(undef, undef, $file)
es_es: utime(undef, undef, $archivo)

source: C<find2perl> now assumes C<-print> as a default action.
es_es: C<find2perl> ahora asume C<-print> como una acción por defecto.

source: don't panic and just set the sticky bit in your /tmp directory by doing the following as root:
es_es: no entre en pánico y establezca el bit sticky en el directorio /tmp haciendo lo siguiente como root:

source: will print the sorted contents of the file named F<"stuff">.
es_es: imprimirá los contenidos ordenados del fichero nombrado como F<"stuff">.

source: } else { return $result;
es_es: } else { return $resultado;

source: Only the best match for C<S> is considered.
es_es: Sólo es considerada la mejor coincidencia para C<S>.

source: While it is a rite of passage to write your own version of these things, please consider carefully whether the Perl world really needs you to publish it.
es_es: Si bien es un rito de paso escribir su propia versión de estas cosas, por favor, considere cuidadosamente si el mundo de Perl realmente lo necesita.

source: It looks like most programming languages you're likely to have experience with, so if you've ever written a C program, an awk script, a shell script, or even a BASIC program, you're already partway there.
es_es: Perl se parece a la mayoría de los lenguajes de programación con los que es probable que tenga experiencia, por lo que si ya ha escrito programas en C, scripts en awk o de shell, o incluso un programa en BASIC, no le costará adaptarse.

source: Perl's C<sprintf> permits the following universally-known conversions:
es_es: Perl C<sprintf> permite las siguientes conversiones universalmente conocidas:

source: To set the default output handle to something other than STDOUT, use the select operation.
es_es: Para configurar el controlador de salida predeterminado a otro valor distinto que STDOUT, use el operador C<select>.

source: Both forms are equivalent.
es_es: Ambas formas son equivalentes.

source: Be aware, however, that, when this construct is followed by a quantifier, it currently triggers a warning message under the C<use warnings> pragma or B<-w> switch saying it C<"matches null string many times in regex">.
es_es: Tenga en cuenta, sin embargo, que, cuando esta construcción es seguida por un cuantificador, actualmente lanza un mensaje de advertencia bajo el pragma C<use warnings> o la opción B<-w>, diciendo C<"matches null string many times in regex"> (I<la cadena nula coincide muchas veces en la exp. reg.>)).

source: /^$/); # (typically in a loop labeled LINE)
es_es: /^$/); # (típicamente en un bucle etiquetado como LINEA)
